In [1]:
import pandas as pd

In [2]:
mov=pd.read_csv('C:/Users/Vishal/Desktop/LU aiml/Data/titles.csv')
mov.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

# How many movies are listed in the titles dataframe?

In [3]:
n_movies=mov['title'].nunique()
n_movies

223828

# What are the earliest two films listed in the titles dataframe?

In [4]:
mov.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# How many movies have the title "Hamlet"?

In [5]:
ham=mov[mov['title']=='Hamlet']
ham.shape[0]

20

# How many movies are titled "North by Northwest"?

In [6]:
mov[mov['title']=="North by Northwest"].shape[0]

1


# When was the first movie titled "Hamlet" made?

In [7]:
mov[mov['title']=="Hamlet"].sort_values('year').head(1).year

52521    1910
Name: year, dtype: int64

# List all of the "Treasure Island" movies from earliest to most recent.

In [8]:
mov[mov['title']=="Treasure Island"].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

# How many movies were made in the year 1950?

In [9]:
mov[mov['year']==1950].shape[0]

1113

# How many movies were made in the year 1960?

In [10]:
mov[mov['year']==1960].shape[0]

1549

# How many movies were made from 1950 through 1959?

In [11]:
mov[(mov['year']>=1950) & (mov['year']<=1959)].shape[0]

12934

# In what years has a movie titled "Batman" been released?

In [12]:
mov[mov['title']=="Batman"].year

39349     1943
240896    1989
Name: year, dtype: int64

In [13]:
role=pd.read_csv('C:/Users/Vishal/Desktop/LU aiml/Data/cast.csv')
role.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

# How many roles were there in the movie "Inception"?

In [14]:
role[role['title']=='Inception'].shape[0]

78

In [15]:
role[role['title']=='Inception']['character'].nunique()

56

# How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
role[role['title']=='Inception']['n'].isnull().sum()

27

# But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
role[role['title']=='Inception'].shape[0] - role[role['title']=='Inception']['n'].isnull().sum()

51

# Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
a=role[role['title']=='North by Northwest']
a.head()

,title,year,name,type,character,n
12668,North by Northwest,1959,Stanley Adams,actor,Lieutenant Harding,NaN
29122,North by Northwest,1959,Andy Albin,actor,Farmer,NaN
56389,North by Northwest,1959,Don Anderson,actor,Worker,NaN
56610,North by Northwest,1959,Ernest Anderson,actor,Porter on Twentieth Century Ltd.,NaN
95950,North by Northwest,1959,Malcolm Atterbury,actor,Man at Prairie Crossing,NaN

In [19]:
a1=a.dropna(axis=0)
a1=a1.sort_values('n')
a1[['name','n']]

                         name     n
871426             Cary Grant   1.0
3518333       Eva Marie Saint   2.0
1457165           James Mason   3.0
3157232   Jessie Royce Landis   4.0
356707         Leo G. Carroll   5.0
3048272  Josephine Hutchinson   6.0
1695173           Philip Ober   7.0
1275337         Martin Landau   8.0
2447081         Adam Williams   9.0
1811387          Edward Platt  10.0
665768      Robert Ellenstein  11.0
2295714          Les Tremayne  12.0
464736        Philip Coolidge  13.0
1508344         Patrick McVey  14.0
206471           Edward Binns  15.0
1384780             Ken Lynch  16.0

# Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [20]:
sl=role[(role['title']=='Sleuth')& (role['year']==1972)]
sl

,title,year,name,type,character,n
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0

In [21]:
sl.sort_values('n')

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

# Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [22]:
sl=role[(role['title']=='Sleuth')& (role['year']==2007)&(role['n'].notnull())]
sl

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

In [23]:
sl[['name','n']].sort_values('n')

                  name    n
326774   Michael Caine  1.0
1293634       Jude Law  2.0
1805907  Harold Pinter  3.0

# How many roles were credited in the silent 1921 version of Hamlet?

In [24]:
role[(role['title']=='Hamlet')&(role['year']==1921)].shape[0]

9

# How many roles were credited in Branagh’s 1996 Hamlet?

In [26]:
role[(role['title']=='Hamlet')&(role['year']==1996)].shape[0]

54

# How many "Hamlet" roles have been listed in all film credits through history?

In [28]:
role[role['title']=='Hamlet'].shape[0]

342

# How many people have played an "Ophelia"?

In [30]:
role[role['title']=='Ophelia'].shape[0]

20

# How many people have played a role called "The Dude"?

In [32]:
role[role['character']=='The Dude'].shape[0]

19

# How many people have played a role called "The Stranger"?

In [33]:
role[role['character']=='The Stranger'].shape[0]

212

# How many roles has Sidney Poitier played throughout his career?

In [34]:
role[role['name']=='Sidney Poitier'].shape[0]

43

# How many roles has Judi Dench played?

In [35]:
role[role['name']=='Judi Dench'].shape[0]

55

# List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [37]:
role[(role['name']=='Cary Grant') & (role['year']>=1940) & (role['n']==2)]

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

# List the leading roles that Cary Grant played in the 1940s in order by year.

In [40]:
role[(role['name']=='Cary Grant') & (role['year']>=1940) & (role['year']<=1949)& (role['n']==1)].sort_values('year')

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

# How many roles were available for actors in the 1950s?

In [45]:
role[(role.type=='actor') & (role.year>=1950) & (role.year<1960)].shape[0]

157738

# How many roles were available for actresses in the 1950s?

In [48]:
role[(role.type=='actress') & (role.year>=1950) & (role.year<1960)].shape[0]

57733

# How many leading roles (n=1) were available from the beginning of film history through 1980?

In [51]:
role[(role['n']==1) & (role.year<=1980)].shape[0]

65140

# How many non-leading roles were available through from the beginning of film history through 1980?

In [56]:
role[(role['n']!=1) & (role.year<1980)].shape[0]

1095378

# How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [58]:
role[(role['n'].isna()) & (role.year<=1980)].shape[0]

448347